0.1.0/tutorials/incompressible/simple/pipe_cyclic/0.org/U
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (1 0 0);

boundaryField
{
  //- Set patchGroups for constraint patches
  #includeEtc "case_dicts/setConstraintTypes"
  inlet
  {
    type            codedFixedValue;
    redirectType    swirl;
    code
    #{
      const vector axis(1, 0, 0);
      vectorField v(2.0*this->patch().Cf() ^ axis);
      v.replace(vector::X, 1.0);
      operator==(v);
    #};
    value           $internalField;
  }
  outlet
  {
    type            inletOutlet;
    inletValue      $internalField;
    value           $internalField;
  }
  walls
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
